<template>
  <div class="tab">
    <div class="vedio">
      <div class="flag" v-observe="'active'">
      <h1 class="vh">{{ vedios.vedioname }}</h1>
      <div class="vtext">
        <img src="./img/wanqing.jpg" alt="" class="miniimg" />
        <div class="it">
          <p>演奏者：{{ vedios.auther}}</p>
          <p>发行：{{ vedios.editor }}</p>
          <p>类型:{{ vedios.type }}</p>
          <p>国家/地区: {{vedios.nation}}</p>
          <p>语言: {{vedios.language}}</p>
          <p>发行日期:{{ vedios.ontime }} </p>
          <p>专辑时长: {{vedios.length}}</p>
          <p>又名:{{vedios.ename }}</p>
        </div>
        <div style="margin-left: 20%;"><the-remark  :grade="vedios.grade" ></the-remark></div>
      </div>
    </div>　
      <!-- <div>
   <el-card class="box-card" style="width: 50%;margin-left: 8%;margin-top: 6%;">
        <p class="text">编号为223的警察（金城武）失恋后患上失恋综合症，在与金发女杀手（林青霞）擦肩而过又离奇相遇并有了一晚温情后，原本以为包括“爱情”在内的所有东西都有保质期的他意外地迎来心灵的短暂温暖。可是，他们的爱情还是结束了.快餐店新来的女招待阿菲（王菲）爱上了时常光顾快餐店的编号 为663的警察（梁朝伟），因拆了他的女友（周嘉玲）留在快餐店给他的“分手” 信，阿菲知晓了他的心情，偷拿到他的钥匙趁他不在时常潜入他家，一边梦游一边悄悄地改变他的生活，终在被他撞见时令其感受到情感的回归。然而，这才是他们爱情的开始。",
        </p>
  </el-card>
      </div> -->
      <the-commens :remarks="remarks" class="flag" v-observe="'active'"></the-commens>
      <el-divider style="margin-top: 6%;"/>
      <div style="display: flex;flex-direction: column;align-items: flex-start;margin-left: 2%;">
      <h2 style=" margin-top:1%;color: rgb(113, 112, 112);">线下活动</h2>
      <div style="display: flex;flex-direction: row;justify-content: space-around;width: 10%;">
      <h3 style="color: #8a8a8a;"><svg t="1702297327125" class="icon" viewBox="0 0 1024 1024" version="1.1"
         xmlns="http://www.w3.org/2000/svg" p-id="5540" width="20" height="20">
         <path d="M495.466219 1024C256.335982 1024 86.993753 856.408725 86.993753 625.658051c0-122.566753 72.664575-254.638684 75.791278-260.016612 6.378474-11.25613 18.885285-17.634604 31.767302-16.133787 12.882016 1.750954 23.137601 11.131062 26.764577 23.512806 0.250136 0.625341 19.88583 74.915801 45.649862 116.063211 17.2594 27.765122 35.019072 47.15068 54.779834 60.908172-13.382288-58.782014-23.637874-147.205172-7.003814-237.754488C360.392654 63.226735 554.248234 3.569244 562.502729 1.19295c10.63079-3.001635 22.137056-0.250136 30.266484 7.25395s11.756403 18.760217 9.505177 29.641144c-0.250136 1.750954-32.392642 176.095907 35.519345 324.55176 6.128338 13.507356 14.758038 29.140871 24.013078 44.899454 2.62643-22.512261 7.003814-44.899454 13.132152-66.786374 25.013623-88.047953 89.423703-118.189369 92.175201-119.314983 10.755858-4.752588 23.26267-3.251771 32.517711 4.00218 9.380109 7.253951 13.757493 19.26049 11.631334 31.016893-0.375204 2.251226-9.380109 62.158854 41.272479 147.205172C898.185552 480.579037 911.192636 530.231079 911.192636 625.908188c-0.125068 230.625605-174.720158 398.091812-415.726417 398.091812zM188.799199 475.451244C170.414186 522.351788 160.783942 572.253966 160.658873 622.656417c0 187.85231 138.450404 324.301624 334.932414 324.301624 197.982827 0 341.686092-136.324246 341.686092-324.301624 0-81.294275-9.880381-118.689642-48.276292-183.349858-25.638964-43.1485-38.395912-81.794548-44.149045-112.81144-7.003814 11.506267-12.381743 23.88801-15.883651 36.770026-18.760217 66.161033-13.882561 143.828333-13.882561 144.70381 0.875477 13.757493-7.504087 26.514441-20.511171 31.267029-13.007084 4.62752-27.389917 0-35.269208-11.256131-2.376294-3.251771-57.031061-81.544411-81.044139-134.448224-49.902178-109.309533-49.276838-227.623971-44.149045-295.661026-50.777655 29.641143-128.695091 96.427517-153.708714 231.876287-24.263214 132.07193 23.012533 270.14713 23.387737 271.397811 4.127248 10.755858 2.00109 23.012533-5.628065 31.767301-7.504087 8.754768-19.135422 12.506812-30.266484 9.755313-3.752043-1.000545-96.552585-23.637874-152.583101-113.061576-10.255585-17.2594-19.135422-35.394277-26.514441-54.154495z m0 0"
         fill="#8a8a8a" p-id="5541"></path></svg>热门</h3>
      <h3>/</h3>
     
      <h3 style="color:#bfbfbf;padding-left: 2%;"> <svg t="1702297415535" class="icon" viewBox="0 0 1024 1024" version="1.1"
       xmlns="http://www.w3.org/2000/svg" p-id="6960" width="20" height="20">
       <path d="M512 995.555556a29.582222 29.582222 0 0 1-20.48-9.102223c-9.102222-9.671111-227.555556-241.777778-296.391111-329.955555A385.706667 385.706667 0 0 1 113.777778 420.408889 398.222222 398.222222 0 0 1 512 28.444444a398.222222 398.222222 0 0 1 398.222222 391.964445 386.275556 386.275556 0 0 1-79.075555 234.951111c-67.697778 88.746667-290.133333 321.422222-299.235556 331.662222a31.288889 31.288889 0 0 1-19.911111 8.533334z m0-910.222223a341.333333 341.333333 0 0 0-341.333333 335.075556 329.955556 329.955556 0 0 0 68.266666 201.386667C292.977778 692.337778 455.111111 864.711111 512 925.582222c56.888889-60.871111 220.16-233.813333 274.204444-304.924444A327.111111 327.111111 0 0 0 853.333333 420.408889 341.333333 341.333333 0 0 0 512 85.333333z" fill="#bfbfbf" p-id="6961"></path><path d="M512 568.888889a184.32 184.32 0 1 1 187.164444-184.32A186.026667 186.026667 0 0 1 512 568.888889z m0-312.32a127.431111 127.431111 0 1 0 130.275556 127.431111A129.137778 129.137778 0 0 0 512 256.568889z"
         fill="#bfbfbf" p-id="6962"></path></svg>附近</h3>
     </div>
    </div>
    <the-hot :activity="activitys" :items="items" :vid="vedios.id" class="flag" v-observe="'active'" ></the-hot>   
    </div>   
  
</div>
</template>
<script>
import TheRemark from "@/components/Home/Remark.vue";
import TheHot from "@/components/Home/Hotactivitys";
import request from "@/utils/request";
import TheCommens from "@/components/Home/Commens.vue";
export default {
  components: {
    TheRemark,
    TheHot,
    TheCommens,
  },
  data(){
    return{
      vedios:[],
      activitys:[],
      remarks:[],
    }
  },
  methods: {
    load(){
      request.get("http://47.109.151.69:9090/vedio/4").then(res=>{         
               this.vedios=res||[];      
      });
      request.get("http://47.109.151.69:9090/activity/4").then(res=>{
               this.activitys=res||[];
               this.activitys[0].picture=require('./img/wanqing.jpg');
               });
     request.get("http://47.109.151.69:9090/remark/4").then(res=>{         
               this.remarks=res||[]; 
              console.log(this.remarks)});
    },
  },
  mounted () { //这个属性就可以，在里面声明初始化时要调用的方法即可
      // we can implement any method here like
     this.load();
    }
};
</script>
<style>

</style>
